SQL/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "odT4awSkqX8FTuyp"], ["long_url", "www.stackoverflow.com"], ["user_id", 10], ["created_at", "2021-03-23 22:31:05.188414"], ["updated_at", "2021-03-23 22:31:05.188414"]]
---
  def self.generate_short_url(user, long_url)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url,
                         short_url: ShortenedUrl.random_code)

SELECT "shortened_urls".* FROM "shortened_urls" WHERE (created_at >= '2021-03-23 22:29:27.025101') AND "shortened_urls"."user_id" = $1  [["user_id", 9]]
---
  def no_spamming
    last_minute = ShortenedUrl.where('created_at >= ?', 1.minute.ago)
                              .where(user_id: user_id)
                              .length