SQL/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["shortened_url_id", 3], ["created_at", "2021-03-23 20:12:51.234352"], ["updated_at", "2021-03-23 20:12:51.234352"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)